cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew 'aircrack-ng'
brew 'binutils'
brew 'binwalk'
brew 'hydra'
brew 'john'
brew 'jq'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'node'
brew 'pngcheck'
brew 'sqlmap'

# Install other useful binaries.
brew 'ack'
brew 'coreutils'
brew 'dark-mode'
brew 'grc'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'lynx'
brew 'openssl'
brew 'readline'
brew 'rename'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

# Install GUI Applications.
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'seashore'
cask 'slack'
cask 'spotify'
cask 'packages'
cask 'suspicious-package'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'

